# linux commands 
# cntr+alt+t
# ~ - символ домашней територии 
 # /   символ корневой дериктории (room)
#  . обозначает текущую територию 
# ..   обозначает педыдущий директорий 


# ls - для вывода списка всех директорий и файлов в текущей дерикторий 


# cd - команда для перехода из одной територии в другую 

# mkdir - создает директорию 
# touch - создает файл
# rm-rf удаляет все 
# rmdir удаляет пустую директорию
# rm удаляет файл
# nano открывает файл для редактирования в грфическом интерфейсе нано 
# если нет файла , то нано создаст новый 











































































