'''Рекурсивное вычисление числа Фибоначчи: Напишите функцию, которая рекурсивно вычисляет n-ное число Фибоначчи.'''

# def fibonacci(n):
#     if n in (1,2):
#         return 1

#     return fibonacci(n - 1)+ fibonacci(n - 2)   
# print(fibonacci(10))
'''Рекурсивный расчет факториала: Напишите функцию, которая рекурсивно вычисляет факториал числа.'''








'''Рекурсивное вычисление степени числа: Напишите функцию, которая рекурсивно вычисляет a в степени b.'''

#
'''Сортировка списка: Напишите функцию для сортировки списка чисел без использования встроенных функций сортировки.'''

#

'''Рекурсивный подсчет элементов в списке: Напишите функцию, которая рекурсивно подсчитывает количество элементов во вложенных списках.'''

#
'''Поиск всех подстрок: Напишите функцию, которая находит все вхождения подстроки в строку и возвращает их индексы.'''

#
'''Генератор последовательности простых чисел: Напишите функцию-генератор, который возвращает последовательность простых чисел.'''

#

'''Кэширование результатов: Напишите функцию, которая кэширует результаты вычислений, чтобы избежать повторных вычислений для одних и тех же аргументов.'''

#

'''Граф обхода: Напишите функцию, которая выполняет обход графа в глубину или в ширину, начиная с заданной вершины.'''

#
