

#1) Реализация кэша с ограниченной емкостью: Напишите функцию, которая реализует простой кэш с ограниченной емкостью, способный хранить только определенное количество элементов. Если кэш заполнился, он должен автоматически удалять наименее используемые элементы.

# x = [21,323,42,23,2424,7,8,9,0]
# def chislo (*args):
#     if len(args) <= 5:
#         return f'{x[:5:]} кэш заполнен осальное удалили'
#     else:
#         return 'ошибка'    
# print(chislo(x))


# 2) Часы и минуты в секунды: Напишите функцию, которая принимает целочисленные значения часов и минут, конвертирует эти значения в секунды, а затем суммирует их и возвращает в качестве результата.
# def timee(a,b):
#     c= a*3600+b*60
#     return c
# print(timee(24,0))   







# 3) Возраст в дни: Напишите функцию, которая принимает возраст (количество лет) и преобразует это значение в количество дней.
# def years(a,b):
#     c= a*365+b*30
#     return c
# print('вам',years(17,4),'дней')







# 4) Сколько ног на ферме: Для решения этой задачи необходимо написать функцию, которая посчитает количество ног у всех животных на ферме. На ферме живут курочки, коровки, и свинки. Зная количество животных каждого вида, посчитайте, сколько всего ног у всех животных на ферме.

# def nogi(a,b,c):
#     d = a*2+b*4+c*4
#     return d
# print(nogi(1,1,1))    


