# Git - расспределенная система контроля версий
# это система для отслеживания и ведения истории изминения файлов, в вашем проекте. При помощи растпределенности git еще и оргпнизовывается командная работа.


# 
# Репозиторий - это хранилище всего кода и истории его изминений


# Github - веб сайт для размещения git-репозиториев  в совместной разработке проектов

# Команды Git:


# 1 git init-> она создает локальный гит репозиторий у вас на пк,  в той директории в которой была прописана команда.

# 2 git status --> команда для проверки статуса наших файлов 

# 3 git add -> команда для добавления файлов в систему отслеживания гита, после этой команды изминения начинают фиксироваться  


# 4 git commit -m 'comment'-> команда для сохранения версии в локальном репозитории, вместе 
# с коментарием к изменениям 

# 5 git remote add origin <urk > -> это команда для того чтобы установить связь локального репозитория с удаленным в гитхабе 

# 6 git push -> команда для отправки ваших изминений в локальном репо в удаленный репо 

#      git push origin main

# ==================================


# 1*) git init 
        # 2) git add
        # 3) git commit -m ''
# 4*) git remote add origin<url>
#              5) git push origin main



# ===================================================================================


# git init 
# git add .
# git commint -m 'coments'
# git remote git@ копируйте и вставляйте при создании нового репозитория 
# git bratch -M main 
# git push origin main 

# после каждого изменения  
# 1 git add .
# 2 git commit -m 'comments'
# 3 git puhs origin main 
# 4 git branch все ветки 
# 5 git branch <название новой ветки >  создание новой веки  
# 6 git checkout <название ветки> переход на ветку 
# 7 git branch -D < название ветки > удаление ветки 
# 8 git merge <название другой ветик> слияние текущей ветки с азванием ветки 
# 9 git clone <ссылка на репозиторий > клонирование или скчивание данного репозитория 
# 10 git push origin main отправка изменений 
# 11 git pull стягивание изменений







































































































































